bit-finance/Reports/бит_СценарноеПрогнозирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_СценарноеПрогнозирование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПустыеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сценарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/AccumulationRegisters/бит_ОборотыПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ОборотыПоБюджетам</Name>
			<Comment>(БИТ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте операции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСценарийЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыЗаписейОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОборота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОборотовОборотыПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 5</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 8</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 9</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 10</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 11</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 12</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

bit-finance/Catalogs/бит_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТекстКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_СценарноеПрогнозирование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	ПроверитьВозможностьФормированияОтчета(СтандартнаяОбработка);
	
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеПараметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПараметрВидОтчета = ТекущиеПараметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидОтчета"));
	
	Если ПараметрВидОтчета = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПараметрВидОтчета.Значение) Тогда		
		ТекстСообщения = НСтр("ru='Для текущего варианта отчета не указан параметр ""Вид отчета""';
							  |en='For the current version of the report parameter ""Report type"" is not specified'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		Возврат;
	КонецЕсли;
	
	ИспользуемыйВидОтчета = ПараметрВидОтчета.Значение;
	
	// При расшифровке если повторно нажать кнопку Расшифровать почему то слетает ВидОтчета.
	Если ЭтоРасшифровка Тогда		
		Если ПустаяСтрока(ВидОтчета) Тогда			
			ВидОтчета = ИспользуемыйВидОтчета;			
		Иначе			
			ИспользуемыйВидОтчета = ВидОтчета;			
		КонецЕсли;		
	Иначе
		ВидОтчета = ИспользуемыйВидОтчета;
	КонецЕсли;
	
	// В СКД 2 набора данных, данные формируются только по тому набору, который соответствует выбранному виду отчета.
	НаборДанныхСКД = СхемаКомпоновкиДанных.НаборыДанных[0].Элементы.Найти(ИспользуемыйВидОтчета);	
	Если НаборДанныхСКД = Неопределено Тогда		
		ТекстСообщения = НСтр("ru='Не найден набор данных для используемого вида отчета.';
						  	  |en='Unable to find a data set for the type of report.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		СтандартнаяОбработка = Ложь;		
		Возврат;		
	КонецЕсли;
	
	НомерТаблицы = 1;
	ТекстЗапроса = "";
	
	СтруктураПараметров = Новый Структура;
	
	// Результат будем выводить в порядке возрастания Даты начала по сценарию.
	ОтсортированныеСценарии = Сценарии.Выгрузить();
	ОтсортированныеСценарии.Сортировать("ДатаНачала Возр");
	
	// Сформируем текст запроса выбранного набора данных.
	Для Каждого ТекущийСценарий Из ОтсортированныеСценарии Цикл
		
		Если ИспользуемыйВидОтчета = "ПоСтатьямОборотов" Тогда
			ТекстЗапросаПоСценарию = ПолучитьТекстЗапросаПоСценариям(НомерТаблицы);
		Иначе
			ТекстЗапросаПоСценарию = ПолучитьТекстЗапросаПоСценариямДляБюджета(НомерТаблицы);
		КонецЕсли;
		
		ТекстОбъединения = ?(НомерТаблицы = 1, "", Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС);
		ТекстЗапроса = ТекстЗапроса + ТекстОбъединения + ТекстЗапросаПоСценарию;
						
		// Запомним параметры для текущего сценария.
		СтруктураПараметров.Вставить("НачалоПериода"+НомерТаблицы, НачалоДня(ТекущийСценарий.ДатаНачала));
		СтруктураПараметров.Вставить("КонецПериода"+НомерТаблицы, КонецДня(ТекущийСценарий.ДатаОкончания));
		СтруктураПараметров.Вставить("Сценарий"+НомерТаблицы, ТекущийСценарий.Сценарий);
		
		НомерТаблицы = НомерТаблицы + 1;
		
	КонецЦикла;
	
	// Укажем общие параметры.
	СтруктураПараметров.Вставить("ВидОтчета"				, ИспользуемыйВидОтчета);
	СтруктураПараметров.Вставить("ПоБюджету"				, НЕ (ИспользуемыйВидОтчета="ПоСтатьямОборотов"));
	СтруктураПараметров.Вставить("Бюджет"					, Бюджет);
	СтруктураПараметров.Вставить("ОтображатьПустыеСтроки"	, ОтображатьПустыеСтроки);
	
	Если ИспользуемыйВидОтчета = "ПоСтатьямОборотов" Тогда
		ОкончаниеТекстаЗапроса = ПолучитьТекстЗапросаОбработкаДанных();
	Иначе
		ОкончаниеТекстаЗапроса = ПолучитьТекстЗапросаОбработкаДанных(Истина);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ";" + Символы.ПС + ОкончаниеТекстаЗапроса;
	
	// Заменим текст запроса в наборе данных.
	НаборДанныхСКД.Запрос = ТекстЗапроса;
	
	
	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("Периодичность");
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла;  	 
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	// Заполним параметры СКД.
	ПараметрыКомпоновки = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Для Каждого ТекущийПараметр Из ПараметрыКомпоновки.Элементы Цикл
		
		ЗначениеПараметра = Неопределено;
		
		Если НЕ СтруктураПараметров.Свойство(Строка(ТекущийПараметр.Параметр), ЗначениеПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийПараметр.Использование 							= Истина;
		ТекущийПараметр.ИдентификаторПользовательскойНастройки  = Новый УникальныйИдентификатор;
		ТекущийПараметр.РежимОтображения 						= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ТекущийПараметр.Значение 								= ЗначениеПараметра;
		
	КонецЦикла;
	
	Для Каждого ТекущийПараметр Из СтруктураПараметров Цикл
		
		Если НЕ ТипЗнч(ТекущийПараметр.Значение) = Тип("Дата") Тогда
			Продолжить;
		КонецЕсли;
		
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ТекущийПараметр.Значение, 
																 ТекущийПараметр.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует текст запроса для выборки данных по конкретному сценарию.
// 
// Параметры:
// 	НомерТаблицы - Число - порядковый номер сценария(нумирация начинается с 1)
// 							, используется для именования параметров запроса.
// 
// Возвращаемое значение:
// 	ТекстЗапроса - Строка.
// 
Функция ПолучитьТекстЗапросаПоСценариям(НомерТаблицы)
	
	Если НомерТаблицы = 1 Тогда
		ВыбратьРазрешенные 	= "РАЗРЕШЕННЫЕ";
		ТекстПОМЕСТИТЬ 		= "ПОМЕСТИТЬ ТаблицаПоСценариям";
		ПоляПостроителя 	= 
		"{ВЫБРАТЬ
		|	Период,
		|	Сценарий.*,
		|	ЦФО.*,
		|	СтатьяОборотов.*,
		|	Валюта.*,
		|	Аналитика_1.*,
		|	Аналитика_2.*,
		|	Аналитика_3.*,
		|	Аналитика_4.*,
		|	Аналитика_5.*,
		|	Аналитика_6.*,
		|	Аналитика_7.*,
		|	Аналитика_8.*,
		|	Аналитика_9.*,
		|	Аналитика_10.*,
		|	Аналитика_11.*,
		|	Аналитика_12.*,
		|	Регистратор.*}";
	Иначе
		ВыбратьРазрешенные 	= "";
		ТекстПОМЕСТИТЬ 		= "";
		ПоляПостроителя 	= "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ // %РАЗРЕШЕННЫЕ%
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ГОД)
	|		ИНАЧЕ бит_ОборотыПоБюджетамОбороты.Период
	|	КОНЕЦ КАК Период,
	|	бит_ОборотыПоБюджетамОбороты.Регистратор 			КАК Регистратор,
	|	бит_ОборотыПоБюджетамОбороты.Сценарий 				КАК Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО 					КАК ЦФО,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов 		КАК СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта 				КАК Валюта,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_1 КАК Аналитика_1,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_2 КАК Аналитика_2,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_3 КАК Аналитика_3,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_4 КАК Аналитика_4,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_5 КАК Аналитика_5,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_6 КАК Аналитика_6,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_7 КАК Аналитика_7,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_8 КАК Аналитика_8,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_9 КАК Аналитика_9,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_10 КАК Аналитика_10,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_11 КАК Аналитика_11,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_12 КАК Аналитика_12,
	|	СУММА(ЕстьNULL(бит_ОборотыПоБюджетамОбороты.КоличествоОборот, 0)) 	 КАК Количество,
	|	СУММА(ЕстьNULL(бит_ОборотыПоБюджетамОбороты.СуммаОборот, 0)) 	 	 КАК Сумма,
	|	СУММА(ЕстьNULL(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот, 0)) 	 КАК СуммаРегл,
	|	СУММА(ЕстьNULL(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот, 0)) 	 КАК СуммаУпр,
	|	СУММА(ЕстьNULL(бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот, 0)) КАК СуммаСценарий
	|	// %НомерТаблицыЧисло% КАК НомерПоВозрастанию
	|// %ТекстПОМЕСТИТЬ%
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Регистратор, Сценарий = &Сценарий) КАК бит_ОборотыПоБюджетамОбороты
	|{ГДЕ
	|	бит_ОборотыПоБюджетамОбороты.Сценарий.*,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО.*,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов.*,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_1,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_2,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_3,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_4,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_5,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_6,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_7,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_8,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_9,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_10,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_11,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_12,
	|	бит_ОборотыПоБюджетамОбороты.Валюта.*,
	|	бит_ОборотыПоБюджетамОбороты.Регистратор.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОборотыПоБюджетамОбороты.Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ГОД)
	|		ИНАЧЕ бит_ОборотыПоБюджетамОбороты.Период
	|	КОНЕЦ,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_1,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_2,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_3,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_4,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_5,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_6,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_7,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_8,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_9,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_10,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_11,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_12,
	|	бит_ОборотыПоБюджетамОбороты.Регистратор";
	
	// Дополним необходимым текстом.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %РАЗРЕШЕННЫЕ%", ВыбратьРазрешенные);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ТекстПОМЕСТИТЬ%", ТекстПОМЕСТИТЬ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляПостроителя%", ПоляПостроителя);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %НомерТаблицыЧисло%", ","+НомерТаблицы);
	
	// Опишем параметры.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПериода"+НомерТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПериода"+НомерТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Сценарий", "&Сценарий"+НомерТаблицы);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоСценариямДляБюджета(НомерТаблицы)
	
	Если НомерТаблицы = 1 Тогда
		ВыбратьРазрешенные 	= "РАЗРЕШЕННЫЕ";
		ТекстПОМЕСТИТЬ 		= "ПОМЕСТИТЬ ТаблицаПоСценариям";
		ПоляПостроителя 	= 
		"{ВЫБРАТЬ
		|	Сценарий.*,
		|	ЦФО.*,
		|	СтатьяОборотов.*,
		|	Валюта.*,
		|	Количество,
		|	Сумма,
		|	СуммаРегл,
		|	СуммаУпр,
		|	СуммаСценарий,
		|	Период,
		|	СтатьяБюджета.*,
		|	Бюджет.*,
		|	Регистратор.*,
		|	Аналитика_1.*,
		|	Аналитика_2.*,
		|	Аналитика_3.*,
		|	Аналитика_4.*,
		|	Аналитика_5.*,
		|	Аналитика_6.*,		
		|	Аналитика_7.*
		|	Аналитика_8.*,
		|	Аналитика_9.*,
		|	Аналитика_10.*,
		|	Аналитика_11.*,		
		|	Аналитика_12.*}";
	Иначе
		ВыбратьРазрешенные 	= "";
		ТекстПОМЕСТИТЬ 		= "";
		ПоляПостроителя 	= "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ // %РАЗРЕШЕННЫЕ%
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ГОД)
	|		ИНАЧЕ бит_ОборотыПоБюджетамОбороты.Период
	|	КОНЕЦ КАК Период,
	|	бит_ОборотыПоБюджетамОбороты.Регистратор 			КАК Регистратор,
	|	бит_ОборотыПоБюджетамОбороты.Сценарий 				КАК Сценарий,
	|	бит_ОборотыПоБюджетамОбороты.ЦФО 					КАК ЦФО,
	|	бит_ОборотыПоБюджетамОбороты.СтатьяОборотов 		КАК СтатьяОборотов,
	|	бит_ОборотыПоБюджетамОбороты.Валюта 				КАК Валюта,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.КоличествоОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0)    КАК Количество,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 		   КАК Сумма,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 	   КАК СуммаРегл,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 	   КАК СуммаУпр,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) КАК СуммаСценарий,
	|	бит_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
	|	бит_СтатьиБюджета.Владелец КАК Бюджет,
	|	ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.КоличествоОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 
	|		+ ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 
	|		+ ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 
	|		+ ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 
	|		+ ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) 
	|		КАК КонтрольнаяСумма,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_1 КАК Аналитика_1,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_2 КАК Аналитика_2,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_3 КАК Аналитика_3,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_4 КАК Аналитика_4,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_5 КАК Аналитика_5,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_6 КАК Аналитика_6,	
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_7 КАК Аналитика_7,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_8 КАК Аналитика_8,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_9 КАК Аналитика_9,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_10 КАК Аналитика_10,
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_11 КАК Аналитика_11,	
	|	бит_ОборотыПоБюджетамОбороты.Аналитика_12 КАК Аналитика_12
	|	// %НомерТаблицыЧисло% КАК НомерПоВозрастанию
	|// %ТекстПОМЕСТИТЬ%
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК бит_СтатьиБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|				&НачалоПериода {(&НачалоПериода)},
	|				&КонецПериода {(&КонецПериода)},
	|				Регистратор,
	|				Сценарий = &Сценарий
	|				И СтатьяОборотов В
	|					(ВЫБРАТЬ
	|						бит_СтатьиБюджета.СтатьяОборотов
	|					ИЗ
	|						Справочник.бит_СтатьиБюджета КАК бит_СтатьиБюджета
	|					ГДЕ
	|						НЕ бит_СтатьиБюджета.НеОтображать
	|						И НЕ бит_СтатьиБюджета.ПометкаУдаления
	|						И бит_СтатьиБюджета.Владелец = &Бюджет) {(ЦФО), (Сценарий), (СтатьяОборотов), (Валюта), (Аналитика_1), (Аналитика_2), (Аналитика_3), (Аналитика_4), (Аналитика_5), (Аналитика_6), (Аналитика_7), (Аналитика_8), (Аналитика_9), (Аналитика_10), (Аналитика_11), (Аналитика_12)}) КАК бит_ОборотыПоБюджетамОбороты
	|		ПО (бит_ОборотыПоБюджетамОбороты.СтатьяОборотов = бит_СтатьиБюджета.СтатьяОборотов)
	|ГДЕ
	|	бит_СтатьиБюджета.Владелец = &Бюджет
	|	И ВЫБОР
	|			КОГДА &ОтображатьПустыеСтроки
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.КоличествоОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) + ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) + ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаРеглОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) + ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаУпрОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) + ЕСТЬNULL(бит_ОборотыПоБюджетамОбороты.СуммаСценарийОборот, 0) * ЕСТЬNULL(бит_СтатьиБюджета.Коэффициент, 0) <> 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И НЕ бит_СтатьиБюджета.НеОтображать
	|	И НЕ бит_СтатьиБюджета.ПометкаУдаления
	|{ГДЕ
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(бит_ОборотыПоБюджетамОбороты.Период, ГОД)
	|		ИНАЧЕ бит_ОборотыПоБюджетамОбороты.Период
	|	КОНЕЦ,
	|	бит_СтатьиБюджета.Ссылка.*,
	|	бит_СтатьиБюджета.Владелец.*,
	|	бит_ОборотыПоБюджетамОбороты.Регистратор.*}";
	
	// Дополним необходимым текстом.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %РАЗРЕШЕННЫЕ%", ВыбратьРазрешенные);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ТекстПОМЕСТИТЬ%", ТекстПОМЕСТИТЬ);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляПостроителя%", ПоляПостроителя);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %НомерТаблицыЧисло%", ","+НомерТаблицы);
	
	// Опишем параметры.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&НачалоПериода"+НомерТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КонецПериода", "&КонецПериода"+НомерТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Сценарий", "&Сценарий"+НомерТаблицы);
	     
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует окончание текста пакетного запроса.
// 
// Параметры:
// 	ПоБюджету - Булево - Истина - текст запроса формируется для вывода данных по статьям бюджета.
// 
// Возвращаемое значение:
// 	ТекстЗапроса - Строка.
// 
Функция ПолучитьТекстЗапросаОбработкаДанных(ПоБюджету = Ложь)
	
	ТекстЗапроса =  
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПоСценариям.Период 				КАК Период,
	|	ТаблицаПоСценариям.Регистратор 			КАК Регистратор,
	|	ТаблицаПоСценариям.Сценарий 			КАК Сценарий,
	|	ТаблицаПоСценариям.ЦФО 					КАК ЦФО,
	|	ТаблицаПоСценариям.СтатьяОборотов 		КАК СтатьяОборотов,
	|	ТаблицаПоСценариям.Валюта 				КАК Валюта,
	|	ТаблицаПоСценариям.Аналитика_1 КАК Аналитика_1,
	|	ТаблицаПоСценариям.Аналитика_2 КАК Аналитика_2,
	|	ТаблицаПоСценариям.Аналитика_3 КАК Аналитика_3,
	|	ТаблицаПоСценариям.Аналитика_4 КАК Аналитика_4,
	|	ТаблицаПоСценариям.Аналитика_5 КАК Аналитика_5,
	|	ТаблицаПоСценариям.Аналитика_6 КАК Аналитика_6,
	|	ТаблицаПоСценариям.Аналитика_7 КАК Аналитика_7,
	|	ТаблицаПоСценариям.Аналитика_8 КАК Аналитика_8,
	|	ТаблицаПоСценариям.Аналитика_9 КАК Аналитика_9,
	|	ТаблицаПоСценариям.Аналитика_10 КАК Аналитика_10,
	|	ТаблицаПоСценариям.Аналитика_11 КАК Аналитика_11,
	|	ТаблицаПоСценариям.Аналитика_12 КАК Аналитика_12,
	|	СУММА(ТаблицаПоСценариям.Количество) 	КАК Количество,
	|	СУММА(ТаблицаПоСценариям.Сумма) 	 	КАК Сумма,
	|	СУММА(ТаблицаПоСценариям.СуммаРегл)  	КАК СуммаРегл,
	|	СУММА(ТаблицаПоСценариям.СуммаУпр) 	 	КАК СуммаУпр,
	|	СУММА(ТаблицаПоСценариям.СуммаСценарий) КАК СуммаСценарий,
	|	ТаблицаПоСценариям.НомерПоВозрастанию
	|	// %ПоляПоБюджету%
	|{ВЫБРАТЬ
	|	Период,
	|	Регистратор.*,
	|	Сценарий.*,
	|	ЦФО.*,
	|	СтатьяОборотов.*,
	|	Валюта.*,
	|	Аналитика_1.*,
	|	Аналитика_2.*,
	|	Аналитика_3.*,
	|	Аналитика_4.*,
	|	Аналитика_5.*,
	|	Аналитика_6.*,
	|	Аналитика_7.*,
	|	Аналитика_8.*,
	|	Аналитика_9.*,
	|	Аналитика_10.*,
	|	Аналитика_11.*,
	|	Аналитика_12.*,
	|	Количество,
	|	Сумма,
	|	СуммаРегл,
	|	СуммаУпр,
	|	СуммаСценарий,
	|	НомерПоВозрастанию
	|	// %ПоляПостроителяПоБюджету%
	|}
	|ИЗ
	|	ТаблицаПоСценариям КАК ТаблицаПоСценариям
	|{ГДЕ
	|	ТаблицаПоСценариям.Период,
	|	ТаблицаПоСценариям.Регистратор.*,
	|	ТаблицаПоСценариям.Сценарий.*,
	|	ТаблицаПоСценариям.ЦФО.*,
	|	ТаблицаПоСценариям.СтатьяОборотов.*,
	|	ТаблицаПоСценариям.Валюта.*,
	|	ТаблицаПоСценариям.Аналитика_1.*,
	|	ТаблицаПоСценариям.Аналитика_2.*,
	|	ТаблицаПоСценариям.Аналитика_3.*,
	|	ТаблицаПоСценариям.Аналитика_4.*,
	|	ТаблицаПоСценариям.Аналитика_5.*,
	|	ТаблицаПоСценариям.Аналитика_6.*,
	|	ТаблицаПоСценариям.Аналитика_7.*,
	|	ТаблицаПоСценариям.Аналитика_8.*,
	|	ТаблицаПоСценариям.Аналитика_9.*,
	|	ТаблицаПоСценариям.Аналитика_10.*,
	|	ТаблицаПоСценариям.Аналитика_11.*,
	|	ТаблицаПоСценариям.Аналитика_12.*,
	|	ТаблицаПоСценариям.Количество,
	|	ТаблицаПоСценариям.Сумма,
	|	ТаблицаПоСценариям.СуммаРегл,
	|	ТаблицаПоСценариям.СуммаУпр,
	|	ТаблицаПоСценариям.СуммаСценарий
	|   // %ПоляПоБюджету%
	|}
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПоСценариям.Период,
	|	ТаблицаПоСценариям.Регистратор,
	|	ТаблицаПоСценариям.Сценарий,
	|	ТаблицаПоСценариям.ЦФО,
	|	ТаблицаПоСценариям.СтатьяОборотов,
	|	ТаблицаПоСценариям.Валюта,
	|	ТаблицаПоСценариям.Аналитика_1,
	|	ТаблицаПоСценариям.Аналитика_2,
	|	ТаблицаПоСценариям.Аналитика_3,
	|	ТаблицаПоСценариям.Аналитика_4,
	|	ТаблицаПоСценариям.Аналитика_5,
	|	ТаблицаПоСценариям.Аналитика_6,
	|	ТаблицаПоСценариям.Аналитика_7,
	|	ТаблицаПоСценариям.Аналитика_8,
	|	ТаблицаПоСценариям.Аналитика_9,
	|	ТаблицаПоСценариям.Аналитика_10,
	|	ТаблицаПоСценариям.Аналитика_11,
	|	ТаблицаПоСценариям.Аналитика_12,
	|	ТаблицаПоСценариям.НомерПоВозрастанию
	|	// %ПоляГруппировки%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПоСценариям";
	
	Если ПоБюджету Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляПоБюджету%", ",ТаблицаПоСценариям.Бюджет КАК Бюджет,
																	   |ТаблицаПоСценариям.СтатьяБюджета КАК СтатьяБюджета");
																	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляПостроителяПоБюджету%", ",СтатьяБюджета.*,
																				  |	Бюджет.*");
																				
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляГруппировки%", ",ТаблицаПоСценариям.Бюджет,
																		 |ТаблицаПоСценариям.СтатьяБюджета");																		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// %ПоляПоБюджету%", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура выполняет проверку заполнения необходимых параметров.
// 
// Параметры:
// 	СтандартнаяОбработка - Булево - Истина - проверка прошла успешно.
// 
Процедура ПроверитьВозможностьФормированияОтчета(СтандартнаяОбработка)
	
	Если Сценарии.Количество() = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстСообщения = НСтр("ru='Не указаны сценарии для прогнозирования.';
						  	  |en='No forecast scenarios specified.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();

бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "НаборДанных1");

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
